HW05/Results/load-orders-html-report/statistics.json
{
  "POST /api/login" : {
    "transaction" : "POST /api/login",
    "sampleCount" : 515,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4718446601941713,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.4383224970395692,
    "receivedKBytesPerSec" : 0.8963605291490717,
    "sentKBytesPerSec" : 0.5118432722465202
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 977,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.402251791197544,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 2.7286234555488527,
    "receivedKBytesPerSec" : 1.232796423604129,
    "sentKBytesPerSec" : 0.9277611035354806
  },
  "Load_Orders_MyOrders" : {
    "transaction" : "Load_Orders_MyOrders",
    "sampleCount" : 515,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 60516.73592233009,
    "medianResTime" : 78828.0,
    "minResTime" : 3956.0,
    "maxResTime" : 81875.0,
    "pct1ResTime" : 80843.4,
    "pct2ResTime" : 81281.8,
    "pct3ResTime" : 81819.92,
    "throughput" : 1.4306747784537601,
    "receivedKBytesPerSec" : 1.2262415097091424,
    "sentKBytesPerSec" : 0.9228280959177153
  },
  "GET /api/orders/my-orders" : {
    "transaction" : "GET /api/orders/my-orders",
    "sampleCount" : 462,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3246753246753245,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.3016687844611177,
    "receivedKBytesPerSec" : 0.33939996626085783,
    "sentKBytesPerSec" : 0.4195821558677933
  }
}