HW05/Results/spike-admin-import-products-html-report/statistics.json
{
  "POST /api/admin/import-products" : {
    "transaction" : "POST /api/admin/import-products",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.8899999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 1.9000000000000057,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.989999999999995,
    "throughput" : 20.15316404675534,
    "receivedKBytesPerSec" : 53.19726798669891,
    "sentKBytesPerSec" : 7.321266626360339
  },
  "GET /api/products (verify)" : {
    "transaction" : "GET /api/products (verify)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.89,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.989999999999995,
    "throughput" : 20.120724346076457,
    "receivedKBytesPerSec" : 611.4027917505031,
    "sentKBytesPerSec" : 6.327024647887324
  },
  "Spike_Admin_Import_Products" : {
    "transaction" : "Spike_Admin_Import_Products",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 6.0600000000000005,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 8.900000000000006,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 11.989999999999995,
    "throughput" : 20.177562550443906,
    "receivedKBytesPerSec" : 686.0568313660209,
    "sentKBytesPerSec" : 25.359885744552056
  },
  "POST /api/login (admin)" : {
    "transaction" : "POST /api/login (admin)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.1399999999999997,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 20.18978396931153,
    "receivedKBytesPerSec" : 12.618614980819704,
    "sentKBytesPerSec" : 5.303761609125782
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 400,
    "errorCount" : 100,
    "errorPct" : 25.0,
    "meanResTime" : 1.5124999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.980000000000018,
    "throughput" : 61.73792251890724,
    "receivedKBytesPerSec" : 524.7874141457015,
    "sentKBytesPerSec" : 19.398609932088284
  },
  "GET /api/categories" : {
    "transaction" : "GET /api/categories",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1300000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.0,
    "throughput" : 20.173492031470648,
    "receivedKBytesPerSec" : 7.052841940689934,
    "sentKBytesPerSec" : 6.38301896308251
  }
}