HW05/Results/stress-reset-password-html-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 331,
    "errorCount" : 264,
    "errorPct" : 79.75831,
    "meanResTime" : 3.486404833836857,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 10.680000000000007,
    "throughput" : 2.247206267736636,
    "receivedKBytesPerSec" : 0.747137209424688,
    "sentKBytesPerSec" : 0.523294397599359
  },
  "POST /api/forgot-password" : {
    "transaction" : "POST /api/forgot-password",
    "sampleCount" : 67,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.925373134328355,
    "medianResTime" : 9.0,
    "minResTime" : 5.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 10.599999999999994,
    "pct3ResTime" : 11.0,
    "throughput" : 1.353070662600723,
    "receivedKBytesPerSec" : 0.4624753241311065,
    "sentKBytesPerSec" : 0.29610253801724656
  },
  "POST /api/reset-password" : {
    "transaction" : "POST /api/reset-password",
    "sampleCount" : 24,
    "errorCount" : 24,
    "errorPct" : 100.0,
    "meanResTime" : 2.124999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.390578828437337,
    "receivedKBytesPerSec" : 0.42097601251520944,
    "sentKBytesPerSec" : 0.3694856668984298
  },
  "POST /api/login (wrong password)" : {
    "transaction" : "POST /api/login (wrong password)",
    "sampleCount" : 240,
    "errorCount" : 240,
    "errorPct" : 100.0,
    "meanResTime" : 2.104166666666668,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.931154347511225,
    "receivedKBytesPerSec" : 0.6427751693783292,
    "sentKBytesPerSec" : 0.450916996572201
  },
  "Stress_Auth_Lockout_Reset" : {
    "transaction" : "Stress_Auth_Lockout_Reset",
    "sampleCount" : 24,
    "errorCount" : 24,
    "errorPct" : 100.0,
    "meanResTime" : 16.999999999999993,
    "medianResTime" : 17.0,
    "minResTime" : 14.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 19.0,
    "throughput" : 1.3896931094383322,
    "receivedKBytesPerSec" : 2.272274898668211,
    "sentKBytesPerSec" : 1.6467546685002896
  }
}